<!DOCTYPE html>
<html lang="fr">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Politique de Confidentialit&eacute; - Le Gu&eacute; Juste</title>
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, sans-serif;
            line-height: 1.7;
            color: #1e293b;
            background: #f8fafc;
            padding: 2rem 1rem;
        }
        .container {
            max-width: 720px;
            margin: 0 auto;
            background: #fff;
            border-radius: 12px;
            padding: 2.5rem 2rem;
            box-shadow: 0 1px 3px rgba(0,0,0,0.08);
        }
        h1 {
            font-size: 1.75rem;
            color: #4F46E5;
            margin-bottom: 0.5rem;
        }
        .subtitle {
            color: #64748b;
            font-size: 0.95rem;
            margin-bottom: 2rem;
            padding-bottom: 1.5rem;
            border-bottom: 1px solid #e2e8f0;
        }
        h2 {
            font-size: 1.15rem;
            color: #334155;
            margin-top: 1.75rem;
            margin-bottom: 0.5rem;
        }
        p, li {
            color: #475569;
            font-size: 0.95rem;
            margin-bottom: 0.75rem;
        }
        ul { padding-left: 1.5rem; margin-bottom: 0.75rem; }
        li { margin-bottom: 0.35rem; }
        .contact {
            margin-top: 2rem;
            padding: 1.25rem;
            background: #f1f5f9;
            border-radius: 8px;
        }
        .contact a { color: #4F46E5; text-decoration: none; }
        .contact a:hover { text-decoration: underline; }
        footer {
            text-align: center;
            margin-top: 2rem;
            color: #94a3b8;
            font-size: 0.85rem;
        }
    </style>
</head>
<body>
    <div class="container">
        <h1>Politique de Confidentialit&eacute;</h1>
        <p class="subtitle">Le Gu&eacute; Juste &mdash; Application de partage de d&eacute;penses<br>Derni&egrave;re mise &agrave; jour : 9 f&eacute;vrier 2026</p>

        <h2>1. Introduction</h2>
        <p>Le Gu&eacute; Juste ("l'Application") est une application mobile de partage de d&eacute;penses entre amis. Nous respectons votre vie priv&eacute;e et nous engageons &agrave; prot&eacute;ger vos donn&eacute;es personnelles. Cette politique explique quelles donn&eacute;es nous collectons, pourquoi, et comment nous les prot&eacute;geons.</p>

        <h2>2. Donn&eacute;es collect&eacute;es</h2>
        <p>Nous collectons uniquement les donn&eacute;es n&eacute;cessaires au fonctionnement de l'Application :</p>
        <ul>
            <li><strong>Num&eacute;ro de t&eacute;l&eacute;phone</strong> &mdash; pour l'authentification via SMS (Firebase Authentication).</li>
            <li><strong>Nom d'affichage et photo de profil</strong> &mdash; fournis volontairement pour vous identifier aupr&egrave;s de vos amis.</li>
            <li><strong>Donn&eacute;es de groupes et d&eacute;penses</strong> &mdash; les groupes que vous cr&eacute;ez, les d&eacute;penses que vous enregistrez et les r&egrave;glements effectu&eacute;s.</li>
            <li><strong>Liste d'amis</strong> &mdash; les contacts ajout&eacute;s via QR code ou invitation.</li>
        </ul>

        <h2>3. Utilisation de la cam&eacute;ra</h2>
        <p>L'Application utilise la cam&eacute;ra de votre appareil <strong>uniquement</strong> pour scanner des QR codes afin d'ajouter des amis ou de rejoindre des groupes. Aucune photo ni vid&eacute;o n'est enregistr&eacute;e, stock&eacute;e ou transmise. L'acc&egrave;s &agrave; la cam&eacute;ra est demand&eacute; au moment de l'utilisation et peut &ecirc;tre r&eacute;voqu&eacute; &agrave; tout moment dans les param&egrave;tres de votre appareil.</p>

        <h2>4. Stockage et s&eacute;curit&eacute;</h2>
        <p>Vos donn&eacute;es sont stock&eacute;es de mani&egrave;re s&eacute;curis&eacute;e sur Google Firebase (Cloud Firestore) avec des r&egrave;gles de s&eacute;curit&eacute; strictes. Chaque utilisateur ne peut acc&eacute;der qu'&agrave; ses propres donn&eacute;es et celles des groupes dont il est membre. Les communications sont chiffr&eacute;es en transit (TLS).</p>

        <h2>5. Partage des donn&eacute;es</h2>
        <p>Nous ne vendons, ne louons et ne partageons pas vos donn&eacute;es personnelles avec des tiers. Vos informations de d&eacute;penses ne sont visibles que par les membres de vos groupes.</p>

        <h2>6. Services tiers</h2>
        <p>L'Application utilise les services suivants :</p>
        <ul>
            <li><strong>Firebase Authentication</strong> &mdash; gestion de la connexion par t&eacute;l&eacute;phone.</li>
            <li><strong>Cloud Firestore</strong> &mdash; base de donn&eacute;es pour stocker les groupes et d&eacute;penses.</li>
            <li><strong>Firebase Storage</strong> &mdash; stockage des photos de profil.</li>
        </ul>
        <p>Ces services sont soumis &agrave; la <a href="https://policies.google.com/privacy" target="_blank" rel="noopener">politique de confidentialit&eacute; de Google</a>.</p>

        <h2>7. Suppression des donn&eacute;es</h2>
        <p>Vous pouvez supprimer votre compte et toutes les donn&eacute;es associ&eacute;es &agrave; tout moment en nous contactant par e-mail. Nous traiterons votre demande dans un d&eacute;lai de 30 jours.</p>

        <h2>8. Modifications</h2>
        <p>Nous pouvons mettre &agrave; jour cette politique. Toute modification sera publi&eacute;e sur cette page avec la date de mise &agrave; jour.</p>

        <div class="contact">
            <h2 style="margin-top:0">9. Contact</h2>
            <p>Pour toute question concernant cette politique ou vos donn&eacute;es :<br>
            <a href="mailto:leguejuste.app@gmail.com">leguejuste.app@gmail.com</a></p>
        </div>
    </div>
    <footer>&copy; 2026 Le Gu&eacute; Juste. Tous droits r&eacute;serv&eacute;s.</footer>
</body>
</html>
